
[FOXDAMAGETYPE_AIRSTRIKE]
suicidestrings=was caught in their own air strike
killstrings=killed %s
killstrings=dropped bombs on %s
killstrings=rained fire on %s

[FOXDAMAGETYPE_CREWSERVED]
suicidestrings=did the impossible
killstrings=killed %s
killstrings=crew-served %s
killstrings=served %s

[FOXDAMAGETYPE_EXPLOSION_LAUNCHERHEGRENADE]
suicidestrings=suicide
killstrings=killed %s
killstrings=blew up %s

[FOXDAMAGETYPE_FLAMETHROWER]
suicidestrings=suicide
killstrings=killed %s
killstrings=set %s ablaze
killstrings=reduced %s to ashes

[FOXDAMAGETYPE_MINIGUN]
suicidestrings=suicide
killstrings=killed %s
killstrings=minigunned %s
killstrings=cut down %s with a minigun

[FOXDAMAGETYPE_RAILGUN]
suicidestrings=suicide
killstrings=killed %s
killstrings=railgunned %s
killstrings=misted %s
killstrings=railed %s

[FOXDAMAGETYPE_ROCKET]
suicidestrings=suicide
killstrings=killed %s
killstrings=rocketed %s
killstrings=rocked %s
killstrings=made %s ride the rocket

[FOXWEAPON_AIRSTRIKE]
friendlyname=Airstrike
friendlytooltip=SHOULDN'T BE USED

[FOXWEAPON_DEPLOYABLETURRETCONTENT]
friendlyname=Turret
friendlytooltip=SHOULDN'T BE USED

[FOXWEAPON_FLAMETHROWER]
friendlyname=Flamethrower
friendlytooltip=SHOULDN'T BE USED

[FOXWEAPON_GRENADELAUNCHER]
friendlyname=Grenade Launcher
friendlytooltip=SHOULDN'T BE USED

[FOXWEAPON_HARDSUITTARGETER]
friendlyname=Rhino Hardsuit
friendlytooltip=SHOULDN'T BE USED
locstringcountdown=HARDSUIT ARRIVAL

[FOXWEAPON_HARDSUITTARGETERLIGHT]
friendlyname=Gunman Hardsuit
friendlytooltip=SHOULDN'T BE USED
locstringcountdown=HARDSUIT ARRIVAL

[FOXWEAPON_MINIGUN]
friendlyname=Minigun
friendlytooltip=SHOULDN'T BE USED

[FOXWEAPON_RAILGUN]
friendlyname=Railgun
friendlytooltip=SHOULDN'T BE USED

[FOXWEAPON_ROCKETLAUNCHER]
friendlyname=Rocket Swarm
friendlytooltip=SHOULDN'T BE USED

[FOXWEAPON_ROCKETLAUNCHER_AV]
friendlyname=Rocket Stinger
friendlytooltip=SHOULDN'T BE USED
